app/controllers/events_controller.rb

INSERT INTO "events" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hsajshdkjas"], ["body", "<p>fsfsfgg</p>\r\n"], ["created_at", "2017-09-12 12:26:19.355218"], ["updated_at", "2017-09-12 12:26:19.355218"]]
---
  def create
    @event = Event.new(event_params)
    if @event.save(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_event
    @event = Event.find(params[:id])